Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
/*
 * Component description for L2CC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_L2CC_COMPONENT_H_
#define _SAMA5D_L2CC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR L2CC                                         */
/* ************************************************************************** */

/* -------- L2CC_IDR : (L2CC Offset: 0x00) ( R/ 32) Cache ID Register -------- */
#define L2CC_IDR_ID_Pos                       _UINT32_(0)                                          /* (L2CC_IDR) Cache Controller ID Position */
#define L2CC_IDR_ID_Msk                       (_UINT32_(0xFFFFFFFF) << L2CC_IDR_ID_Pos)            /* (L2CC_IDR) Cache Controller ID Mask */
#define L2CC_IDR_ID(value)                    (L2CC_IDR_ID_Msk & (_UINT32_(value) << L2CC_IDR_ID_Pos)) /* Assigment of value for ID in the L2CC_IDR register */
#define L2CC_IDR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (L2CC_IDR) Register Mask  */


/* -------- L2CC_TYPR : (L2CC Offset: 0x04) ( R/ 32) Cache Type Register -------- */
#define L2CC_TYPR_IL2ASS_Pos                  _UINT32_(6)                                          /* (L2CC_TYPR) Instruction L2 Cache Associativity Position */
#define L2CC_TYPR_IL2ASS_Msk                  (_UINT32_(0x1) << L2CC_TYPR_IL2ASS_Pos)              /* (L2CC_TYPR) Instruction L2 Cache Associativity Mask */
#define L2CC_TYPR_IL2ASS(value)               (L2CC_TYPR_IL2ASS_Msk & (_UINT32_(value) << L2CC_TYPR_IL2ASS_Pos)) /* Assigment of value for IL2ASS in the L2CC_TYPR register */
#define L2CC_TYPR_IL2WSIZE_Pos                _UINT32_(8)                                          /* (L2CC_TYPR) Instruction L2 Cache Way Size Position */
#define L2CC_TYPR_IL2WSIZE_Msk                (_UINT32_(0x7) << L2CC_TYPR_IL2WSIZE_Pos)            /* (L2CC_TYPR) Instruction L2 Cache Way Size Mask */
#define L2CC_TYPR_IL2WSIZE(value)             (L2CC_TYPR_IL2WSIZE_Msk & (_UINT32_(value) << L2CC_TYPR_IL2WSIZE_Pos)) /* Assigment of value for IL2WSIZE in the L2CC_TYPR register */
#define L2CC_TYPR_DL2ASS_Pos                  _UINT32_(18)                                         /* (L2CC_TYPR) Data L2 Cache Associativity Position */
#define L2CC_TYPR_DL2ASS_Msk                  (_UINT32_(0x1) << L2CC_TYPR_DL2ASS_Pos)              /* (L2CC_TYPR) Data L2 Cache Associativity Mask */
#define L2CC_TYPR_DL2ASS(value)               (L2CC_TYPR_DL2ASS_Msk & (_UINT32_(value) << L2CC_TYPR_DL2ASS_Pos)) /* Assigment of value for DL2ASS in the L2CC_TYPR register */
#define L2CC_TYPR_DL2WSIZE_Pos                _UINT32_(20)                                         /* (L2CC_TYPR) Data L2 Cache Way Size Position */
#define L2CC_TYPR_DL2WSIZE_Msk                (_UINT32_(0x7) << L2CC_TYPR_DL2WSIZE_Pos)            /* (L2CC_TYPR) Data L2 Cache Way Size Mask */
#define L2CC_TYPR_DL2WSIZE(value)             (L2CC_TYPR_DL2WSIZE_Msk & (_UINT32_(value) << L2CC_TYPR_DL2WSIZE_Pos)) /* Assigment of value for DL2WSIZE in the L2CC_TYPR register */
#define L2CC_TYPR_Msk                         _UINT32_(0x00740740)                                 /* (L2CC_TYPR) Register Mask  */


/* -------- L2CC_CR : (L2CC Offset: 0x100) (R/W 32) Control Register -------- */
#define L2CC_CR_L2CEN_Pos                     _UINT32_(0)                                          /* (L2CC_CR) L2 Cache Enable Position */
#define L2CC_CR_L2CEN_Msk                     (_UINT32_(0x1) << L2CC_CR_L2CEN_Pos)                 /* (L2CC_CR) L2 Cache Enable Mask */
#define L2CC_CR_L2CEN(value)                  (L2CC_CR_L2CEN_Msk & (_UINT32_(value) << L2CC_CR_L2CEN_Pos)) /* Assigment of value for L2CEN in the L2CC_CR register */
#define L2CC_CR_Msk                           _UINT32_(0x00000001)                                 /* (L2CC_CR) Register Mask  */


/* -------- L2CC_ACR : (L2CC Offset: 0x104) (R/W 32) Auxiliary Control Register -------- */
#define L2CC_ACR_HPSO_Pos                     _UINT32_(10)                                         /* (L2CC_ACR) High Priority for SO and Dev Reads Enable Position */
#define L2CC_ACR_HPSO_Msk                     (_UINT32_(0x1) << L2CC_ACR_HPSO_Pos)                 /* (L2CC_ACR) High Priority for SO and Dev Reads Enable Mask */
#define L2CC_ACR_HPSO(value)                  (L2CC_ACR_HPSO_Msk & (_UINT32_(value) << L2CC_ACR_HPSO_Pos)) /* Assigment of value for HPSO in the L2CC_ACR register */
#define L2CC_ACR_SBDLE_Pos                    _UINT32_(11)                                         /* (L2CC_ACR) Store Buffer Device Limitation Enable Position */
#define L2CC_ACR_SBDLE_Msk                    (_UINT32_(0x1) << L2CC_ACR_SBDLE_Pos)                /* (L2CC_ACR) Store Buffer Device Limitation Enable Mask */
#define L2CC_ACR_SBDLE(value)                 (L2CC_ACR_SBDLE_Msk & (_UINT32_(value) << L2CC_ACR_SBDLE_Pos)) /* Assigment of value for SBDLE in the L2CC_ACR register */
#define L2CC_ACR_EXCC_Pos                     _UINT32_(12)                                         /* (L2CC_ACR) Exclusive Cache Configuration Position */
#define L2CC_ACR_EXCC_Msk                     (_UINT32_(0x1) << L2CC_ACR_EXCC_Pos)                 /* (L2CC_ACR) Exclusive Cache Configuration Mask */
#define L2CC_ACR_EXCC(value)                  (L2CC_ACR_EXCC_Msk & (_UINT32_(value) << L2CC_ACR_EXCC_Pos)) /* Assigment of value for EXCC in the L2CC_ACR register */
#define L2CC_ACR_SAIE_Pos                     _UINT32_(13)                                         /* (L2CC_ACR) Shared Attribute Invalidate Enable Position */
#define L2CC_ACR_SAIE_Msk                     (_UINT32_(0x1) << L2CC_ACR_SAIE_Pos)                 /* (L2CC_ACR) Shared Attribute Invalidate Enable Mask */
#define L2CC_ACR_SAIE(value)                  (L2CC_ACR_SAIE_Msk & (_UINT32_(value) << L2CC_ACR_SAIE_Pos)) /* Assigment of value for SAIE in the L2CC_ACR register */
#define L2CC_ACR_ASS_Pos                      _UINT32_(16)                                         /* (L2CC_ACR) Associativity Position */
#define L2CC_ACR_ASS_Msk                      (_UINT32_(0x1) << L2CC_ACR_ASS_Pos)                  /* (L2CC_ACR) Associativity Mask */
#define L2CC_ACR_ASS(value)                   (L2CC_ACR_ASS_Msk & (_UINT32_(value) << L2CC_ACR_ASS_Pos)) /* Assigment of value for ASS in the L2CC_ACR register */
#define L2CC_ACR_WAYSIZE_Pos                  _UINT32_(17)                                         /* (L2CC_ACR) Way Size Position */
#define L2CC_ACR_WAYSIZE_Msk                  (_UINT32_(0x7) << L2CC_ACR_WAYSIZE_Pos)              /* (L2CC_ACR) Way Size Mask */
#define L2CC_ACR_WAYSIZE(value)               (L2CC_ACR_WAYSIZE_Msk & (_UINT32_(value) << L2CC_ACR_WAYSIZE_Pos)) /* Assigment of value for WAYSIZE in the L2CC_ACR register */
#define   L2CC_ACR_WAYSIZE_16KB_WAY_Val       _UINT32_(0x1)                                        /* (L2CC_ACR) 16-Kbyte way set associative  */
#define L2CC_ACR_WAYSIZE_16KB_WAY             (L2CC_ACR_WAYSIZE_16KB_WAY_Val << L2CC_ACR_WAYSIZE_Pos) /* (L2CC_ACR) 16-Kbyte way set associative Position  */
#define L2CC_ACR_EMBEN_Pos                    _UINT32_(20)                                         /* (L2CC_ACR) Event Monitor Bus Enable Position */
#define L2CC_ACR_EMBEN_Msk                    (_UINT32_(0x1) << L2CC_ACR_EMBEN_Pos)                /* (L2CC_ACR) Event Monitor Bus Enable Mask */
#define L2CC_ACR_EMBEN(value)                 (L2CC_ACR_EMBEN_Msk & (_UINT32_(value) << L2CC_ACR_EMBEN_Pos)) /* Assigment of value for EMBEN in the L2CC_ACR register */
#define L2CC_ACR_PEN_Pos                      _UINT32_(21)                                         /* (L2CC_ACR) Parity Enable Position */
#define L2CC_ACR_PEN_Msk                      (_UINT32_(0x1) << L2CC_ACR_PEN_Pos)                  /* (L2CC_ACR) Parity Enable Mask */
#define L2CC_ACR_PEN(value)                   (L2CC_ACR_PEN_Msk & (_UINT32_(value) << L2CC_ACR_PEN_Pos)) /* Assigment of value for PEN in the L2CC_ACR register */
#define L2CC_ACR_SAOEN_Pos                    _UINT32_(22)                                         /* (L2CC_ACR) Shared Attribute Override Enable Position */
#define L2CC_ACR_SAOEN_Msk                    (_UINT32_(0x1) << L2CC_ACR_SAOEN_Pos)                /* (L2CC_ACR) Shared Attribute Override Enable Mask */
#define L2CC_ACR_SAOEN(value)                 (L2CC_ACR_SAOEN_Msk & (_UINT32_(value) << L2CC_ACR_SAOEN_Pos)) /* Assigment of value for SAOEN in the L2CC_ACR register */
#define L2CC_ACR_FWA_Pos                      _UINT32_(23)                                         /* (L2CC_ACR) Force Write Allocate Position */
#define L2CC_ACR_FWA_Msk                      (_UINT32_(0x3) << L2CC_ACR_FWA_Pos)                  /* (L2CC_ACR) Force Write Allocate Mask */
#define L2CC_ACR_FWA(value)                   (L2CC_ACR_FWA_Msk & (_UINT32_(value) << L2CC_ACR_FWA_Pos)) /* Assigment of value for FWA in the L2CC_ACR register */
#define L2CC_ACR_CRPOL_Pos                    _UINT32_(25)                                         /* (L2CC_ACR) Cache Replacement Policy Position */
#define L2CC_ACR_CRPOL_Msk                    (_UINT32_(0x1) << L2CC_ACR_CRPOL_Pos)                /* (L2CC_ACR) Cache Replacement Policy Mask */
#define L2CC_ACR_CRPOL(value)                 (L2CC_ACR_CRPOL_Msk & (_UINT32_(value) << L2CC_ACR_CRPOL_Pos)) /* Assigment of value for CRPOL in the L2CC_ACR register */
#define L2CC_ACR_NSLEN_Pos                    _UINT32_(26)                                         /* (L2CC_ACR) Non-Secure Lockdown Enable Position */
#define L2CC_ACR_NSLEN_Msk                    (_UINT32_(0x1) << L2CC_ACR_NSLEN_Pos)                /* (L2CC_ACR) Non-Secure Lockdown Enable Mask */
#define L2CC_ACR_NSLEN(value)                 (L2CC_ACR_NSLEN_Msk & (_UINT32_(value) << L2CC_ACR_NSLEN_Pos)) /* Assigment of value for NSLEN in the L2CC_ACR register */
#define L2CC_ACR_NSIAC_Pos                    _UINT32_(27)                                         /* (L2CC_ACR) Non-Secure Interrupt Access Control Position */
#define L2CC_ACR_NSIAC_Msk                    (_UINT32_(0x1) << L2CC_ACR_NSIAC_Pos)                /* (L2CC_ACR) Non-Secure Interrupt Access Control Mask */
#define L2CC_ACR_NSIAC(value)                 (L2CC_ACR_NSIAC_Msk & (_UINT32_(value) << L2CC_ACR_NSIAC_Pos)) /* Assigment of value for NSIAC in the L2CC_ACR register */
#define L2CC_ACR_DPEN_Pos                     _UINT32_(28)                                         /* (L2CC_ACR) Data Prefetch Enable Position */
#define L2CC_ACR_DPEN_Msk                     (_UINT32_(0x1) << L2CC_ACR_DPEN_Pos)                 /* (L2CC_ACR) Data Prefetch Enable Mask */
#define L2CC_ACR_DPEN(value)                  (L2CC_ACR_DPEN_Msk & (_UINT32_(value) << L2CC_ACR_DPEN_Pos)) /* Assigment of value for DPEN in the L2CC_ACR register */
#define L2CC_ACR_IPEN_Pos                     _UINT32_(29)                                         /* (L2CC_ACR) Instruction Prefetch Enable Position */
#define L2CC_ACR_IPEN_Msk                     (_UINT32_(0x1) << L2CC_ACR_IPEN_Pos)                 /* (L2CC_ACR) Instruction Prefetch Enable Mask */
#define L2CC_ACR_IPEN(value)                  (L2CC_ACR_IPEN_Msk & (_UINT32_(value) << L2CC_ACR_IPEN_Pos)) /* Assigment of value for IPEN in the L2CC_ACR register */
#define L2CC_ACR_Msk                          _UINT32_(0x3FFF3C00)                                 /* (L2CC_ACR) Register Mask  */


/* -------- L2CC_TRCR : (L2CC Offset: 0x108) (R/W 32) Tag RAM Control Register -------- */
#define L2CC_TRCR_TSETLAT_Pos                 _UINT32_(0)                                          /* (L2CC_TRCR) Setup Latency Position */
#define L2CC_TRCR_TSETLAT_Msk                 (_UINT32_(0x7) << L2CC_TRCR_TSETLAT_Pos)             /* (L2CC_TRCR) Setup Latency Mask */
#define L2CC_TRCR_TSETLAT(value)              (L2CC_TRCR_TSETLAT_Msk & (_UINT32_(value) << L2CC_TRCR_TSETLAT_Pos)) /* Assigment of value for TSETLAT in the L2CC_TRCR register */
#define L2CC_TRCR_TRDLAT_Pos                  _UINT32_(4)                                          /* (L2CC_TRCR) Read Access Latency Position */
#define L2CC_TRCR_TRDLAT_Msk                  (_UINT32_(0x7) << L2CC_TRCR_TRDLAT_Pos)              /* (L2CC_TRCR) Read Access Latency Mask */
#define L2CC_TRCR_TRDLAT(value)               (L2CC_TRCR_TRDLAT_Msk & (_UINT32_(value) << L2CC_TRCR_TRDLAT_Pos)) /* Assigment of value for TRDLAT in the L2CC_TRCR register */
#define L2CC_TRCR_TWRLAT_Pos                  _UINT32_(8)                                          /* (L2CC_TRCR) Write Access Latency Position */
#define L2CC_TRCR_TWRLAT_Msk                  (_UINT32_(0x7) << L2CC_TRCR_TWRLAT_Pos)              /* (L2CC_TRCR) Write Access Latency Mask */
#define L2CC_TRCR_TWRLAT(value)               (L2CC_TRCR_TWRLAT_Msk & (_UINT32_(value) << L2CC_TRCR_TWRLAT_Pos)) /* Assigment of value for TWRLAT in the L2CC_TRCR register */
#define L2CC_TRCR_Msk                         _UINT32_(0x00000777)                                 /* (L2CC_TRCR) Register Mask  */


/* -------- L2CC_DRCR : (L2CC Offset: 0x10C) (R/W 32) Data RAM Control Register -------- */
#define L2CC_DRCR_DSETLAT_Pos                 _UINT32_(0)                                          /* (L2CC_DRCR) Setup Latency Position */
#define L2CC_DRCR_DSETLAT_Msk                 (_UINT32_(0x7) << L2CC_DRCR_DSETLAT_Pos)             /* (L2CC_DRCR) Setup Latency Mask */
#define L2CC_DRCR_DSETLAT(value)              (L2CC_DRCR_DSETLAT_Msk & (_UINT32_(value) << L2CC_DRCR_DSETLAT_Pos)) /* Assigment of value for DSETLAT in the L2CC_DRCR register */
#define L2CC_DRCR_DRDLAT_Pos                  _UINT32_(4)                                          /* (L2CC_DRCR) Read Access Latency Position */
#define L2CC_DRCR_DRDLAT_Msk                  (_UINT32_(0x7) << L2CC_DRCR_DRDLAT_Pos)              /* (L2CC_DRCR) Read Access Latency Mask */
#define L2CC_DRCR_DRDLAT(value)               (L2CC_DRCR_DRDLAT_Msk & (_UINT32_(value) << L2CC_DRCR_DRDLAT_Pos)) /* Assigment of value for DRDLAT in the L2CC_DRCR register */
#define L2CC_DRCR_DWRLAT_Pos                  _UINT32_(8)                                          /* (L2CC_DRCR) Write Access Latency Position */
#define L2CC_DRCR_DWRLAT_Msk                  (_UINT32_(0x7) << L2CC_DRCR_DWRLAT_Pos)              /* (L2CC_DRCR) Write Access Latency Mask */
#define L2CC_DRCR_DWRLAT(value)               (L2CC_DRCR_DWRLAT_Msk & (_UINT32_(value) << L2CC_DRCR_DWRLAT_Pos)) /* Assigment of value for DWRLAT in the L2CC_DRCR register */
#define L2CC_DRCR_Msk                         _UINT32_(0x00000777)                                 /* (L2CC_DRCR) Register Mask  */


/* -------- L2CC_ECR : (L2CC Offset: 0x200) (R/W 32) Event Counter Control Register -------- */
#define L2CC_ECR_EVCEN_Pos                    _UINT32_(0)                                          /* (L2CC_ECR) Event Counter Enable Position */
#define L2CC_ECR_EVCEN_Msk                    (_UINT32_(0x1) << L2CC_ECR_EVCEN_Pos)                /* (L2CC_ECR) Event Counter Enable Mask */
#define L2CC_ECR_EVCEN(value)                 (L2CC_ECR_EVCEN_Msk & (_UINT32_(value) << L2CC_ECR_EVCEN_Pos)) /* Assigment of value for EVCEN in the L2CC_ECR register */
#define L2CC_ECR_EVC0RST_Pos                  _UINT32_(1)                                          /* (L2CC_ECR) Event Counter 0 Reset Position */
#define L2CC_ECR_EVC0RST_Msk                  (_UINT32_(0x1) << L2CC_ECR_EVC0RST_Pos)              /* (L2CC_ECR) Event Counter 0 Reset Mask */
#define L2CC_ECR_EVC0RST(value)               (L2CC_ECR_EVC0RST_Msk & (_UINT32_(value) << L2CC_ECR_EVC0RST_Pos)) /* Assigment of value for EVC0RST in the L2CC_ECR register */
#define L2CC_ECR_EVC1RST_Pos                  _UINT32_(2)                                          /* (L2CC_ECR) Event Counter 1 Reset Position */
#define L2CC_ECR_EVC1RST_Msk                  (_UINT32_(0x1) << L2CC_ECR_EVC1RST_Pos)              /* (L2CC_ECR) Event Counter 1 Reset Mask */
#define L2CC_ECR_EVC1RST(value)               (L2CC_ECR_EVC1RST_Msk & (_UINT32_(value) << L2CC_ECR_EVC1RST_Pos)) /* Assigment of value for EVC1RST in the L2CC_ECR register */
#define L2CC_ECR_Msk                          _UINT32_(0x00000007)                                 /* (L2CC_ECR) Register Mask  */


