Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
/* -------- L2CC_ECFGR1 : (L2CC Offset: 0x204) (R/W 32) Event Counter 1 Configuration Register -------- */
#define L2CC_ECFGR1_EIGEN_Pos                 _UINT32_(0)                                          /* (L2CC_ECFGR1) Event Counter Interrupt Generation Position */
#define L2CC_ECFGR1_EIGEN_Msk                 (_UINT32_(0x3) << L2CC_ECFGR1_EIGEN_Pos)             /* (L2CC_ECFGR1) Event Counter Interrupt Generation Mask */
#define L2CC_ECFGR1_EIGEN(value)              (L2CC_ECFGR1_EIGEN_Msk & (_UINT32_(value) << L2CC_ECFGR1_EIGEN_Pos)) /* Assigment of value for EIGEN in the L2CC_ECFGR1 register */
#define   L2CC_ECFGR1_EIGEN_INT_DIS_Val       _UINT32_(0x0)                                        /* (L2CC_ECFGR1) Disables (default)  */
#define   L2CC_ECFGR1_EIGEN_INT_EN_INCR_Val   _UINT32_(0x1)                                        /* (L2CC_ECFGR1) Enables with Increment condition  */
#define   L2CC_ECFGR1_EIGEN_INT_EN_OVER_Val   _UINT32_(0x2)                                        /* (L2CC_ECFGR1) Enables with Overflow condition  */
#define   L2CC_ECFGR1_EIGEN_INT_GEN_DIS_Val   _UINT32_(0x3)                                        /* (L2CC_ECFGR1) Disables Interrupt generation  */
#define L2CC_ECFGR1_EIGEN_INT_DIS             (L2CC_ECFGR1_EIGEN_INT_DIS_Val << L2CC_ECFGR1_EIGEN_Pos) /* (L2CC_ECFGR1) Disables (default) Position  */
#define L2CC_ECFGR1_EIGEN_INT_EN_INCR         (L2CC_ECFGR1_EIGEN_INT_EN_INCR_Val << L2CC_ECFGR1_EIGEN_Pos) /* (L2CC_ECFGR1) Enables with Increment condition Position  */
#define L2CC_ECFGR1_EIGEN_INT_EN_OVER         (L2CC_ECFGR1_EIGEN_INT_EN_OVER_Val << L2CC_ECFGR1_EIGEN_Pos) /* (L2CC_ECFGR1) Enables with Overflow condition Position  */
#define L2CC_ECFGR1_EIGEN_INT_GEN_DIS         (L2CC_ECFGR1_EIGEN_INT_GEN_DIS_Val << L2CC_ECFGR1_EIGEN_Pos) /* (L2CC_ECFGR1) Disables Interrupt generation Position  */
#define L2CC_ECFGR1_ESRC_Pos                  _UINT32_(2)                                          /* (L2CC_ECFGR1) Event Counter Source Position */
#define L2CC_ECFGR1_ESRC_Msk                  (_UINT32_(0xF) << L2CC_ECFGR1_ESRC_Pos)              /* (L2CC_ECFGR1) Event Counter Source Mask */
#define L2CC_ECFGR1_ESRC(value)               (L2CC_ECFGR1_ESRC_Msk & (_UINT32_(value) << L2CC_ECFGR1_ESRC_Pos)) /* Assigment of value for ESRC in the L2CC_ECFGR1 register */
#define   L2CC_ECFGR1_ESRC_CNT_DIS_Val        _UINT32_(0x0)                                        /* (L2CC_ECFGR1) Counter Disabled  */
#define   L2CC_ECFGR1_ESRC_SRC_CO_Val         _UINT32_(0x1)                                        /* (L2CC_ECFGR1) Source is CO  */
#define   L2CC_ECFGR1_ESRC_SRC_DRHIT_Val      _UINT32_(0x2)                                        /* (L2CC_ECFGR1) Source is DRHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_DRREQ_Val      _UINT32_(0x3)                                        /* (L2CC_ECFGR1) Source is DRREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_DWHIT_Val      _UINT32_(0x4)                                        /* (L2CC_ECFGR1) Source is DWHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_DWREQ_Val      _UINT32_(0x5)                                        /* (L2CC_ECFGR1) Source is DWREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_DWTREQ_Val     _UINT32_(0x6)                                        /* (L2CC_ECFGR1) Source is DWTREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_IRHIT_Val      _UINT32_(0x7)                                        /* (L2CC_ECFGR1) Source is IRHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_IRREQ_Val      _UINT32_(0x8)                                        /* (L2CC_ECFGR1) Source is IRREQ  */
#define   L2CC_ECFGR1_ESRC_SRC_WA_Val         _UINT32_(0x9)                                        /* (L2CC_ECFGR1) Source is WA  */
#define   L2CC_ECFGR1_ESRC_SRC_IPFALLOC_Val   _UINT32_(0xA)                                        /* (L2CC_ECFGR1) Source is IPFALLOC  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFHIT_Val     _UINT32_(0xB)                                        /* (L2CC_ECFGR1) Source is EPFHIT  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFALLOC_Val   _UINT32_(0xC)                                        /* (L2CC_ECFGR1) Source is EPFALLOC  */
#define   L2CC_ECFGR1_ESRC_SRC_SRRCVD_Val     _UINT32_(0xD)                                        /* (L2CC_ECFGR1) Source is SRRCVD  */
#define   L2CC_ECFGR1_ESRC_SRC_SRCONF_Val     _UINT32_(0xE)                                        /* (L2CC_ECFGR1) Source is SRCONF  */
#define   L2CC_ECFGR1_ESRC_SRC_EPFRCVD_Val    _UINT32_(0xF)                                        /* (L2CC_ECFGR1) Source is EPFRCVD  */
#define L2CC_ECFGR1_ESRC_CNT_DIS              (L2CC_ECFGR1_ESRC_CNT_DIS_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Counter Disabled Position  */
#define L2CC_ECFGR1_ESRC_SRC_CO               (L2CC_ECFGR1_ESRC_SRC_CO_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is CO Position  */
#define L2CC_ECFGR1_ESRC_SRC_DRHIT            (L2CC_ECFGR1_ESRC_SRC_DRHIT_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is DRHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_DRREQ            (L2CC_ECFGR1_ESRC_SRC_DRREQ_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is DRREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWHIT            (L2CC_ECFGR1_ESRC_SRC_DWHIT_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is DWHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWREQ            (L2CC_ECFGR1_ESRC_SRC_DWREQ_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is DWREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_DWTREQ           (L2CC_ECFGR1_ESRC_SRC_DWTREQ_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is DWTREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_IRHIT            (L2CC_ECFGR1_ESRC_SRC_IRHIT_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is IRHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_IRREQ            (L2CC_ECFGR1_ESRC_SRC_IRREQ_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is IRREQ Position  */
#define L2CC_ECFGR1_ESRC_SRC_WA               (L2CC_ECFGR1_ESRC_SRC_WA_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is WA Position  */
#define L2CC_ECFGR1_ESRC_SRC_IPFALLOC         (L2CC_ECFGR1_ESRC_SRC_IPFALLOC_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is IPFALLOC Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFHIT           (L2CC_ECFGR1_ESRC_SRC_EPFHIT_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is EPFHIT Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFALLOC         (L2CC_ECFGR1_ESRC_SRC_EPFALLOC_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is EPFALLOC Position  */
#define L2CC_ECFGR1_ESRC_SRC_SRRCVD           (L2CC_ECFGR1_ESRC_SRC_SRRCVD_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is SRRCVD Position  */
#define L2CC_ECFGR1_ESRC_SRC_SRCONF           (L2CC_ECFGR1_ESRC_SRC_SRCONF_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is SRCONF Position  */
#define L2CC_ECFGR1_ESRC_SRC_EPFRCVD          (L2CC_ECFGR1_ESRC_SRC_EPFRCVD_Val << L2CC_ECFGR1_ESRC_Pos) /* (L2CC_ECFGR1) Source is EPFRCVD Position  */
#define L2CC_ECFGR1_Msk                       _UINT32_(0x0000003F)                                 /* (L2CC_ECFGR1) Register Mask  */


/* -------- L2CC_ECFGR0 : (L2CC Offset: 0x208) (R/W 32) Event Counter 0 Configuration Register -------- */
#define L2CC_ECFGR0_EIGEN_Pos                 _UINT32_(0)                                          /* (L2CC_ECFGR0) Event Counter Interrupt Generation Position */
#define L2CC_ECFGR0_EIGEN_Msk                 (_UINT32_(0x3) << L2CC_ECFGR0_EIGEN_Pos)             /* (L2CC_ECFGR0) Event Counter Interrupt Generation Mask */
#define L2CC_ECFGR0_EIGEN(value)              (L2CC_ECFGR0_EIGEN_Msk & (_UINT32_(value) << L2CC_ECFGR0_EIGEN_Pos)) /* Assigment of value for EIGEN in the L2CC_ECFGR0 register */
#define   L2CC_ECFGR0_EIGEN_INT_DIS_Val       _UINT32_(0x0)                                        /* (L2CC_ECFGR0) Disables (default)  */
#define   L2CC_ECFGR0_EIGEN_INT_EN_INCR_Val   _UINT32_(0x1)                                        /* (L2CC_ECFGR0) Enables with Increment condition  */
#define   L2CC_ECFGR0_EIGEN_INT_EN_OVER_Val   _UINT32_(0x2)                                        /* (L2CC_ECFGR0) Enables with Overflow condition  */
#define   L2CC_ECFGR0_EIGEN_INT_GEN_DIS_Val   _UINT32_(0x3)                                        /* (L2CC_ECFGR0) Disables Interrupt generation  */
#define L2CC_ECFGR0_EIGEN_INT_DIS             (L2CC_ECFGR0_EIGEN_INT_DIS_Val << L2CC_ECFGR0_EIGEN_Pos) /* (L2CC_ECFGR0) Disables (default) Position  */
#define L2CC_ECFGR0_EIGEN_INT_EN_INCR         (L2CC_ECFGR0_EIGEN_INT_EN_INCR_Val << L2CC_ECFGR0_EIGEN_Pos) /* (L2CC_ECFGR0) Enables with Increment condition Position  */
#define L2CC_ECFGR0_EIGEN_INT_EN_OVER         (L2CC_ECFGR0_EIGEN_INT_EN_OVER_Val << L2CC_ECFGR0_EIGEN_Pos) /* (L2CC_ECFGR0) Enables with Overflow condition Position  */
#define L2CC_ECFGR0_EIGEN_INT_GEN_DIS         (L2CC_ECFGR0_EIGEN_INT_GEN_DIS_Val << L2CC_ECFGR0_EIGEN_Pos) /* (L2CC_ECFGR0) Disables Interrupt generation Position  */
#define L2CC_ECFGR0_ESRC_Pos                  _UINT32_(2)                                          /* (L2CC_ECFGR0) Event Counter Source Position */
#define L2CC_ECFGR0_ESRC_Msk                  (_UINT32_(0xF) << L2CC_ECFGR0_ESRC_Pos)              /* (L2CC_ECFGR0) Event Counter Source Mask */
#define L2CC_ECFGR0_ESRC(value)               (L2CC_ECFGR0_ESRC_Msk & (_UINT32_(value) << L2CC_ECFGR0_ESRC_Pos)) /* Assigment of value for ESRC in the L2CC_ECFGR0 register */
#define   L2CC_ECFGR0_ESRC_CNT_DIS_Val        _UINT32_(0x0)                                        /* (L2CC_ECFGR0) Counter Disabled  */
#define   L2CC_ECFGR0_ESRC_SRC_CO_Val         _UINT32_(0x1)                                        /* (L2CC_ECFGR0) Source is CO  */
#define   L2CC_ECFGR0_ESRC_SRC_DRHIT_Val      _UINT32_(0x2)                                        /* (L2CC_ECFGR0) Source is DRHIT  */
#define   L2CC_ECFGR0_ESRC_SRC_DRREQ_Val      _UINT32_(0x3)                                        /* (L2CC_ECFGR0) Source is DRREQ  */
#define   L2CC_ECFGR0_ESRC_SRC_DWHIT_Val      _UINT32_(0x4)                                        /* (L2CC_ECFGR0) Source is DWHIT  */
#define   L2CC_ECFGR0_ESRC_SRC_DWREQ_Val      _UINT32_(0x5)                                        /* (L2CC_ECFGR0) Source is DWREQ  */
#define   L2CC_ECFGR0_ESRC_SRC_DWTREQ_Val     _UINT32_(0x6)                                        /* (L2CC_ECFGR0) Source is DWTREQ  */
#define   L2CC_ECFGR0_ESRC_SRC_IRHIT_Val      _UINT32_(0x7)                                        /* (L2CC_ECFGR0) Source is IRHIT  */
#define   L2CC_ECFGR0_ESRC_SRC_IRREQ_Val      _UINT32_(0x8)                                        /* (L2CC_ECFGR0) Source is IRREQ  */
#define   L2CC_ECFGR0_ESRC_SRC_WA_Val         _UINT32_(0x9)                                        /* (L2CC_ECFGR0) Source is WA  */
#define   L2CC_ECFGR0_ESRC_SRC_IPFALLOC_Val   _UINT32_(0xA)                                        /* (L2CC_ECFGR0) Source is IPFALLOC  */
#define   L2CC_ECFGR0_ESRC_SRC_EPFHIT_Val     _UINT32_(0xB)                                        /* (L2CC_ECFGR0) Source is EPFHIT  */
#define   L2CC_ECFGR0_ESRC_SRC_EPFALLOC_Val   _UINT32_(0xC)                                        /* (L2CC_ECFGR0) Source is EPFALLOC  */
#define   L2CC_ECFGR0_ESRC_SRC_SRRCVD_Val     _UINT32_(0xD)                                        /* (L2CC_ECFGR0) Source is SRRCVD  */
#define   L2CC_ECFGR0_ESRC_SRC_SRCONF_Val     _UINT32_(0xE)                                        /* (L2CC_ECFGR0) Source is SRCONF  */
#define   L2CC_ECFGR0_ESRC_SRC_EPFRCVD_Val    _UINT32_(0xF)                                        /* (L2CC_ECFGR0) Source is EPFRCVD  */
#define L2CC_ECFGR0_ESRC_CNT_DIS              (L2CC_ECFGR0_ESRC_CNT_DIS_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Counter Disabled Position  */
#define L2CC_ECFGR0_ESRC_SRC_CO               (L2CC_ECFGR0_ESRC_SRC_CO_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is CO Position  */
#define L2CC_ECFGR0_ESRC_SRC_DRHIT            (L2CC_ECFGR0_ESRC_SRC_DRHIT_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is DRHIT Position  */
#define L2CC_ECFGR0_ESRC_SRC_DRREQ            (L2CC_ECFGR0_ESRC_SRC_DRREQ_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is DRREQ Position  */
#define L2CC_ECFGR0_ESRC_SRC_DWHIT            (L2CC_ECFGR0_ESRC_SRC_DWHIT_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is DWHIT Position  */
#define L2CC_ECFGR0_ESRC_SRC_DWREQ            (L2CC_ECFGR0_ESRC_SRC_DWREQ_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is DWREQ Position  */
#define L2CC_ECFGR0_ESRC_SRC_DWTREQ           (L2CC_ECFGR0_ESRC_SRC_DWTREQ_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is DWTREQ Position  */
#define L2CC_ECFGR0_ESRC_SRC_IRHIT            (L2CC_ECFGR0_ESRC_SRC_IRHIT_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is IRHIT Position  */
#define L2CC_ECFGR0_ESRC_SRC_IRREQ            (L2CC_ECFGR0_ESRC_SRC_IRREQ_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is IRREQ Position  */
#define L2CC_ECFGR0_ESRC_SRC_WA               (L2CC_ECFGR0_ESRC_SRC_WA_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is WA Position  */
#define L2CC_ECFGR0_ESRC_SRC_IPFALLOC         (L2CC_ECFGR0_ESRC_SRC_IPFALLOC_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is IPFALLOC Position  */
#define L2CC_ECFGR0_ESRC_SRC_EPFHIT           (L2CC_ECFGR0_ESRC_SRC_EPFHIT_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is EPFHIT Position  */
#define L2CC_ECFGR0_ESRC_SRC_EPFALLOC         (L2CC_ECFGR0_ESRC_SRC_EPFALLOC_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is EPFALLOC Position  */
#define L2CC_ECFGR0_ESRC_SRC_SRRCVD           (L2CC_ECFGR0_ESRC_SRC_SRRCVD_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is SRRCVD Position  */
#define L2CC_ECFGR0_ESRC_SRC_SRCONF           (L2CC_ECFGR0_ESRC_SRC_SRCONF_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is SRCONF Position  */
#define L2CC_ECFGR0_ESRC_SRC_EPFRCVD          (L2CC_ECFGR0_ESRC_SRC_EPFRCVD_Val << L2CC_ECFGR0_ESRC_Pos) /* (L2CC_ECFGR0) Source is EPFRCVD Position  */
#define L2CC_ECFGR0_Msk                       _UINT32_(0x0000003F)                                 /* (L2CC_ECFGR0) Register Mask  */


/* -------- L2CC_EVR1 : (L2CC Offset: 0x20C) (R/W 32) Event Counter 1 Value Register -------- */
#define L2CC_EVR1_VALUE_Pos                   _UINT32_(0)                                          /* (L2CC_EVR1) Event Counter Value Position */
#define L2CC_EVR1_VALUE_Msk                   (_UINT32_(0xFFFFFFFF) << L2CC_EVR1_VALUE_Pos)        /* (L2CC_EVR1) Event Counter Value Mask */
#define L2CC_EVR1_VALUE(value)                (L2CC_EVR1_VALUE_Msk & (_UINT32_(value) << L2CC_EVR1_VALUE_Pos)) /* Assigment of value for VALUE in the L2CC_EVR1 register */
#define L2CC_EVR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (L2CC_EVR1) Register Mask  */


