Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
/* -------- L2CC_EVR0 : (L2CC Offset: 0x210) (R/W 32) Event Counter 0 Value Register -------- */
#define L2CC_EVR0_VALUE_Pos                   _UINT32_(0)                                          /* (L2CC_EVR0) Event Counter Value Position */
#define L2CC_EVR0_VALUE_Msk                   (_UINT32_(0xFFFFFFFF) << L2CC_EVR0_VALUE_Pos)        /* (L2CC_EVR0) Event Counter Value Mask */
#define L2CC_EVR0_VALUE(value)                (L2CC_EVR0_VALUE_Msk & (_UINT32_(value) << L2CC_EVR0_VALUE_Pos)) /* Assigment of value for VALUE in the L2CC_EVR0 register */
#define L2CC_EVR0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (L2CC_EVR0) Register Mask  */


/* -------- L2CC_IMR : (L2CC Offset: 0x214) (R/W 32) Interrupt Mask Register -------- */
#define L2CC_IMR_ECNTR_Pos                    _UINT32_(0)                                          /* (L2CC_IMR) Event Counter 1/0 Overflow Increment Position */
#define L2CC_IMR_ECNTR_Msk                    (_UINT32_(0x1) << L2CC_IMR_ECNTR_Pos)                /* (L2CC_IMR) Event Counter 1/0 Overflow Increment Mask */
#define L2CC_IMR_ECNTR(value)                 (L2CC_IMR_ECNTR_Msk & (_UINT32_(value) << L2CC_IMR_ECNTR_Pos)) /* Assigment of value for ECNTR in the L2CC_IMR register */
#define L2CC_IMR_PARRT_Pos                    _UINT32_(1)                                          /* (L2CC_IMR) Parity Error on L2 Tag RAM, Read Position */
#define L2CC_IMR_PARRT_Msk                    (_UINT32_(0x1) << L2CC_IMR_PARRT_Pos)                /* (L2CC_IMR) Parity Error on L2 Tag RAM, Read Mask */
#define L2CC_IMR_PARRT(value)                 (L2CC_IMR_PARRT_Msk & (_UINT32_(value) << L2CC_IMR_PARRT_Pos)) /* Assigment of value for PARRT in the L2CC_IMR register */
#define L2CC_IMR_PARRD_Pos                    _UINT32_(2)                                          /* (L2CC_IMR) Parity Error on L2 Data RAM, Read Position */
#define L2CC_IMR_PARRD_Msk                    (_UINT32_(0x1) << L2CC_IMR_PARRD_Pos)                /* (L2CC_IMR) Parity Error on L2 Data RAM, Read Mask */
#define L2CC_IMR_PARRD(value)                 (L2CC_IMR_PARRD_Msk & (_UINT32_(value) << L2CC_IMR_PARRD_Pos)) /* Assigment of value for PARRD in the L2CC_IMR register */
#define L2CC_IMR_ERRWT_Pos                    _UINT32_(3)                                          /* (L2CC_IMR) Error on L2 Tag RAM, Write Position */
#define L2CC_IMR_ERRWT_Msk                    (_UINT32_(0x1) << L2CC_IMR_ERRWT_Pos)                /* (L2CC_IMR) Error on L2 Tag RAM, Write Mask */
#define L2CC_IMR_ERRWT(value)                 (L2CC_IMR_ERRWT_Msk & (_UINT32_(value) << L2CC_IMR_ERRWT_Pos)) /* Assigment of value for ERRWT in the L2CC_IMR register */
#define L2CC_IMR_ERRWD_Pos                    _UINT32_(4)                                          /* (L2CC_IMR) Error on L2 Data RAM, Write Position */
#define L2CC_IMR_ERRWD_Msk                    (_UINT32_(0x1) << L2CC_IMR_ERRWD_Pos)                /* (L2CC_IMR) Error on L2 Data RAM, Write Mask */
#define L2CC_IMR_ERRWD(value)                 (L2CC_IMR_ERRWD_Msk & (_UINT32_(value) << L2CC_IMR_ERRWD_Pos)) /* Assigment of value for ERRWD in the L2CC_IMR register */
#define L2CC_IMR_ERRRT_Pos                    _UINT32_(5)                                          /* (L2CC_IMR) Error on L2 Tag RAM, Read Position */
#define L2CC_IMR_ERRRT_Msk                    (_UINT32_(0x1) << L2CC_IMR_ERRRT_Pos)                /* (L2CC_IMR) Error on L2 Tag RAM, Read Mask */
#define L2CC_IMR_ERRRT(value)                 (L2CC_IMR_ERRRT_Msk & (_UINT32_(value) << L2CC_IMR_ERRRT_Pos)) /* Assigment of value for ERRRT in the L2CC_IMR register */
#define L2CC_IMR_ERRRD_Pos                    _UINT32_(6)                                          /* (L2CC_IMR) Error on L2 Data RAM, Read Position */
#define L2CC_IMR_ERRRD_Msk                    (_UINT32_(0x1) << L2CC_IMR_ERRRD_Pos)                /* (L2CC_IMR) Error on L2 Data RAM, Read Mask */
#define L2CC_IMR_ERRRD(value)                 (L2CC_IMR_ERRRD_Msk & (_UINT32_(value) << L2CC_IMR_ERRRD_Pos)) /* Assigment of value for ERRRD in the L2CC_IMR register */
#define L2CC_IMR_SLVERR_Pos                   _UINT32_(7)                                          /* (L2CC_IMR) SLVERR from L3 Memory Position */
#define L2CC_IMR_SLVERR_Msk                   (_UINT32_(0x1) << L2CC_IMR_SLVERR_Pos)               /* (L2CC_IMR) SLVERR from L3 Memory Mask */
#define L2CC_IMR_SLVERR(value)                (L2CC_IMR_SLVERR_Msk & (_UINT32_(value) << L2CC_IMR_SLVERR_Pos)) /* Assigment of value for SLVERR in the L2CC_IMR register */
#define L2CC_IMR_DECERR_Pos                   _UINT32_(8)                                          /* (L2CC_IMR) DECERR from L3 Memory Position */
#define L2CC_IMR_DECERR_Msk                   (_UINT32_(0x1) << L2CC_IMR_DECERR_Pos)               /* (L2CC_IMR) DECERR from L3 Memory Mask */
#define L2CC_IMR_DECERR(value)                (L2CC_IMR_DECERR_Msk & (_UINT32_(value) << L2CC_IMR_DECERR_Pos)) /* Assigment of value for DECERR in the L2CC_IMR register */
#define L2CC_IMR_Msk                          _UINT32_(0x000001FF)                                 /* (L2CC_IMR) Register Mask  */


/* -------- L2CC_MISR : (L2CC Offset: 0x218) ( R/ 32) Masked Interrupt Status Register -------- */
#define L2CC_MISR_ECNTR_Pos                   _UINT32_(0)                                          /* (L2CC_MISR) Event Counter 1/0 Overflow Increment Position */
#define L2CC_MISR_ECNTR_Msk                   (_UINT32_(0x1) << L2CC_MISR_ECNTR_Pos)               /* (L2CC_MISR) Event Counter 1/0 Overflow Increment Mask */
#define L2CC_MISR_ECNTR(value)                (L2CC_MISR_ECNTR_Msk & (_UINT32_(value) << L2CC_MISR_ECNTR_Pos)) /* Assigment of value for ECNTR in the L2CC_MISR register */
#define L2CC_MISR_PARRT_Pos                   _UINT32_(1)                                          /* (L2CC_MISR) Parity Error on L2 Tag RAM, Read Position */
#define L2CC_MISR_PARRT_Msk                   (_UINT32_(0x1) << L2CC_MISR_PARRT_Pos)               /* (L2CC_MISR) Parity Error on L2 Tag RAM, Read Mask */
#define L2CC_MISR_PARRT(value)                (L2CC_MISR_PARRT_Msk & (_UINT32_(value) << L2CC_MISR_PARRT_Pos)) /* Assigment of value for PARRT in the L2CC_MISR register */
#define L2CC_MISR_PARRD_Pos                   _UINT32_(2)                                          /* (L2CC_MISR) Parity Error on L2 Data RAM, Read Position */
#define L2CC_MISR_PARRD_Msk                   (_UINT32_(0x1) << L2CC_MISR_PARRD_Pos)               /* (L2CC_MISR) Parity Error on L2 Data RAM, Read Mask */
#define L2CC_MISR_PARRD(value)                (L2CC_MISR_PARRD_Msk & (_UINT32_(value) << L2CC_MISR_PARRD_Pos)) /* Assigment of value for PARRD in the L2CC_MISR register */
#define L2CC_MISR_ERRWT_Pos                   _UINT32_(3)                                          /* (L2CC_MISR) Error on L2 Tag RAM, Write Position */
#define L2CC_MISR_ERRWT_Msk                   (_UINT32_(0x1) << L2CC_MISR_ERRWT_Pos)               /* (L2CC_MISR) Error on L2 Tag RAM, Write Mask */
#define L2CC_MISR_ERRWT(value)                (L2CC_MISR_ERRWT_Msk & (_UINT32_(value) << L2CC_MISR_ERRWT_Pos)) /* Assigment of value for ERRWT in the L2CC_MISR register */
#define L2CC_MISR_ERRWD_Pos                   _UINT32_(4)                                          /* (L2CC_MISR) Error on L2 Data RAM, Write Position */
#define L2CC_MISR_ERRWD_Msk                   (_UINT32_(0x1) << L2CC_MISR_ERRWD_Pos)               /* (L2CC_MISR) Error on L2 Data RAM, Write Mask */
#define L2CC_MISR_ERRWD(value)                (L2CC_MISR_ERRWD_Msk & (_UINT32_(value) << L2CC_MISR_ERRWD_Pos)) /* Assigment of value for ERRWD in the L2CC_MISR register */
#define L2CC_MISR_ERRRT_Pos                   _UINT32_(5)                                          /* (L2CC_MISR) Error on L2 Tag RAM, Read Position */
#define L2CC_MISR_ERRRT_Msk                   (_UINT32_(0x1) << L2CC_MISR_ERRRT_Pos)               /* (L2CC_MISR) Error on L2 Tag RAM, Read Mask */
#define L2CC_MISR_ERRRT(value)                (L2CC_MISR_ERRRT_Msk & (_UINT32_(value) << L2CC_MISR_ERRRT_Pos)) /* Assigment of value for ERRRT in the L2CC_MISR register */
#define L2CC_MISR_ERRRD_Pos                   _UINT32_(6)                                          /* (L2CC_MISR) Error on L2 Data RAM, Read Position */
#define L2CC_MISR_ERRRD_Msk                   (_UINT32_(0x1) << L2CC_MISR_ERRRD_Pos)               /* (L2CC_MISR) Error on L2 Data RAM, Read Mask */
#define L2CC_MISR_ERRRD(value)                (L2CC_MISR_ERRRD_Msk & (_UINT32_(value) << L2CC_MISR_ERRRD_Pos)) /* Assigment of value for ERRRD in the L2CC_MISR register */
#define L2CC_MISR_SLVERR_Pos                  _UINT32_(7)                                          /* (L2CC_MISR) SLVERR from L3 memory Position */
#define L2CC_MISR_SLVERR_Msk                  (_UINT32_(0x1) << L2CC_MISR_SLVERR_Pos)              /* (L2CC_MISR) SLVERR from L3 memory Mask */
#define L2CC_MISR_SLVERR(value)               (L2CC_MISR_SLVERR_Msk & (_UINT32_(value) << L2CC_MISR_SLVERR_Pos)) /* Assigment of value for SLVERR in the L2CC_MISR register */
#define L2CC_MISR_DECERR_Pos                  _UINT32_(8)                                          /* (L2CC_MISR) DECERR from L3 memory Position */
#define L2CC_MISR_DECERR_Msk                  (_UINT32_(0x1) << L2CC_MISR_DECERR_Pos)              /* (L2CC_MISR) DECERR from L3 memory Mask */
#define L2CC_MISR_DECERR(value)               (L2CC_MISR_DECERR_Msk & (_UINT32_(value) << L2CC_MISR_DECERR_Pos)) /* Assigment of value for DECERR in the L2CC_MISR register */
#define L2CC_MISR_Msk                         _UINT32_(0x000001FF)                                 /* (L2CC_MISR) Register Mask  */


/* -------- L2CC_RISR : (L2CC Offset: 0x21C) ( R/ 32) Raw Interrupt Status Register -------- */
#define L2CC_RISR_ECNTR_Pos                   _UINT32_(0)                                          /* (L2CC_RISR) Event Counter 1/0 Overflow Increment Position */
#define L2CC_RISR_ECNTR_Msk                   (_UINT32_(0x1) << L2CC_RISR_ECNTR_Pos)               /* (L2CC_RISR) Event Counter 1/0 Overflow Increment Mask */
#define L2CC_RISR_ECNTR(value)                (L2CC_RISR_ECNTR_Msk & (_UINT32_(value) << L2CC_RISR_ECNTR_Pos)) /* Assigment of value for ECNTR in the L2CC_RISR register */
#define L2CC_RISR_PARRT_Pos                   _UINT32_(1)                                          /* (L2CC_RISR) Parity Error on L2 Tag RAM, Read Position */
#define L2CC_RISR_PARRT_Msk                   (_UINT32_(0x1) << L2CC_RISR_PARRT_Pos)               /* (L2CC_RISR) Parity Error on L2 Tag RAM, Read Mask */
#define L2CC_RISR_PARRT(value)                (L2CC_RISR_PARRT_Msk & (_UINT32_(value) << L2CC_RISR_PARRT_Pos)) /* Assigment of value for PARRT in the L2CC_RISR register */
#define L2CC_RISR_PARRD_Pos                   _UINT32_(2)                                          /* (L2CC_RISR) Parity Error on L2 Data RAM, Read Position */
#define L2CC_RISR_PARRD_Msk                   (_UINT32_(0x1) << L2CC_RISR_PARRD_Pos)               /* (L2CC_RISR) Parity Error on L2 Data RAM, Read Mask */
#define L2CC_RISR_PARRD(value)                (L2CC_RISR_PARRD_Msk & (_UINT32_(value) << L2CC_RISR_PARRD_Pos)) /* Assigment of value for PARRD in the L2CC_RISR register */
#define L2CC_RISR_ERRWT_Pos                   _UINT32_(3)                                          /* (L2CC_RISR) Error on L2 Tag RAM, Write Position */
#define L2CC_RISR_ERRWT_Msk                   (_UINT32_(0x1) << L2CC_RISR_ERRWT_Pos)               /* (L2CC_RISR) Error on L2 Tag RAM, Write Mask */
#define L2CC_RISR_ERRWT(value)                (L2CC_RISR_ERRWT_Msk & (_UINT32_(value) << L2CC_RISR_ERRWT_Pos)) /* Assigment of value for ERRWT in the L2CC_RISR register */
#define L2CC_RISR_ERRWD_Pos                   _UINT32_(4)                                          /* (L2CC_RISR) Error on L2 Data RAM, Write Position */
#define L2CC_RISR_ERRWD_Msk                   (_UINT32_(0x1) << L2CC_RISR_ERRWD_Pos)               /* (L2CC_RISR) Error on L2 Data RAM, Write Mask */
#define L2CC_RISR_ERRWD(value)                (L2CC_RISR_ERRWD_Msk & (_UINT32_(value) << L2CC_RISR_ERRWD_Pos)) /* Assigment of value for ERRWD in the L2CC_RISR register */
#define L2CC_RISR_ERRRT_Pos                   _UINT32_(5)                                          /* (L2CC_RISR) Error on L2 Tag RAM, Read Position */
#define L2CC_RISR_ERRRT_Msk                   (_UINT32_(0x1) << L2CC_RISR_ERRRT_Pos)               /* (L2CC_RISR) Error on L2 Tag RAM, Read Mask */
#define L2CC_RISR_ERRRT(value)                (L2CC_RISR_ERRRT_Msk & (_UINT32_(value) << L2CC_RISR_ERRRT_Pos)) /* Assigment of value for ERRRT in the L2CC_RISR register */
#define L2CC_RISR_ERRRD_Pos                   _UINT32_(6)                                          /* (L2CC_RISR) Error on L2 Data RAM, Read Position */
#define L2CC_RISR_ERRRD_Msk                   (_UINT32_(0x1) << L2CC_RISR_ERRRD_Pos)               /* (L2CC_RISR) Error on L2 Data RAM, Read Mask */
#define L2CC_RISR_ERRRD(value)                (L2CC_RISR_ERRRD_Msk & (_UINT32_(value) << L2CC_RISR_ERRRD_Pos)) /* Assigment of value for ERRRD in the L2CC_RISR register */
#define L2CC_RISR_SLVERR_Pos                  _UINT32_(7)                                          /* (L2CC_RISR) SLVERR from L3 memory Position */
#define L2CC_RISR_SLVERR_Msk                  (_UINT32_(0x1) << L2CC_RISR_SLVERR_Pos)              /* (L2CC_RISR) SLVERR from L3 memory Mask */
#define L2CC_RISR_SLVERR(value)               (L2CC_RISR_SLVERR_Msk & (_UINT32_(value) << L2CC_RISR_SLVERR_Pos)) /* Assigment of value for SLVERR in the L2CC_RISR register */
#define L2CC_RISR_DECERR_Pos                  _UINT32_(8)                                          /* (L2CC_RISR) DECERR from L3 memory Position */
#define L2CC_RISR_DECERR_Msk                  (_UINT32_(0x1) << L2CC_RISR_DECERR_Pos)              /* (L2CC_RISR) DECERR from L3 memory Mask */
#define L2CC_RISR_DECERR(value)               (L2CC_RISR_DECERR_Msk & (_UINT32_(value) << L2CC_RISR_DECERR_Pos)) /* Assigment of value for DECERR in the L2CC_RISR register */
#define L2CC_RISR_Msk                         _UINT32_(0x000001FF)                                 /* (L2CC_RISR) Register Mask  */


/* -------- L2CC_ICR : (L2CC Offset: 0x220) (R/W 32) Interrupt Clear Register -------- */
#define L2CC_ICR_ECNTR_Pos                    _UINT32_(0)                                          /* (L2CC_ICR) Event Counter 1/0 Overflow Increment Position */
#define L2CC_ICR_ECNTR_Msk                    (_UINT32_(0x1) << L2CC_ICR_ECNTR_Pos)                /* (L2CC_ICR) Event Counter 1/0 Overflow Increment Mask */
#define L2CC_ICR_ECNTR(value)                 (L2CC_ICR_ECNTR_Msk & (_UINT32_(value) << L2CC_ICR_ECNTR_Pos)) /* Assigment of value for ECNTR in the L2CC_ICR register */
#define L2CC_ICR_PARRT_Pos                    _UINT32_(1)                                          /* (L2CC_ICR) Parity Error on L2 Tag RAM, Read Position */
#define L2CC_ICR_PARRT_Msk                    (_UINT32_(0x1) << L2CC_ICR_PARRT_Pos)                /* (L2CC_ICR) Parity Error on L2 Tag RAM, Read Mask */
#define L2CC_ICR_PARRT(value)                 (L2CC_ICR_PARRT_Msk & (_UINT32_(value) << L2CC_ICR_PARRT_Pos)) /* Assigment of value for PARRT in the L2CC_ICR register */
#define L2CC_ICR_PARRD_Pos                    _UINT32_(2)                                          /* (L2CC_ICR) Parity Error on L2 Data RAM, Read Position */
#define L2CC_ICR_PARRD_Msk                    (_UINT32_(0x1) << L2CC_ICR_PARRD_Pos)                /* (L2CC_ICR) Parity Error on L2 Data RAM, Read Mask */
#define L2CC_ICR_PARRD(value)                 (L2CC_ICR_PARRD_Msk & (_UINT32_(value) << L2CC_ICR_PARRD_Pos)) /* Assigment of value for PARRD in the L2CC_ICR register */
#define L2CC_ICR_ERRWT_Pos                    _UINT32_(3)                                          /* (L2CC_ICR) Error on L2 Tag RAM, Write Position */
#define L2CC_ICR_ERRWT_Msk                    (_UINT32_(0x1) << L2CC_ICR_ERRWT_Pos)                /* (L2CC_ICR) Error on L2 Tag RAM, Write Mask */
#define L2CC_ICR_ERRWT(value)                 (L2CC_ICR_ERRWT_Msk & (_UINT32_(value) << L2CC_ICR_ERRWT_Pos)) /* Assigment of value for ERRWT in the L2CC_ICR register */
#define L2CC_ICR_ERRWD_Pos                    _UINT32_(4)                                          /* (L2CC_ICR) Error on L2 Data RAM, Write Position */
#define L2CC_ICR_ERRWD_Msk                    (_UINT32_(0x1) << L2CC_ICR_ERRWD_Pos)                /* (L2CC_ICR) Error on L2 Data RAM, Write Mask */
#define L2CC_ICR_ERRWD(value)                 (L2CC_ICR_ERRWD_Msk & (_UINT32_(value) << L2CC_ICR_ERRWD_Pos)) /* Assigment of value for ERRWD in the L2CC_ICR register */
#define L2CC_ICR_ERRRT_Pos                    _UINT32_(5)                                          /* (L2CC_ICR) Error on L2 Tag RAM, Read Position */
#define L2CC_ICR_ERRRT_Msk                    (_UINT32_(0x1) << L2CC_ICR_ERRRT_Pos)                /* (L2CC_ICR) Error on L2 Tag RAM, Read Mask */
#define L2CC_ICR_ERRRT(value)                 (L2CC_ICR_ERRRT_Msk & (_UINT32_(value) << L2CC_ICR_ERRRT_Pos)) /* Assigment of value for ERRRT in the L2CC_ICR register */
#define L2CC_ICR_ERRRD_Pos                    _UINT32_(6)                                          /* (L2CC_ICR) Error on L2 Data RAM, Read Position */
#define L2CC_ICR_ERRRD_Msk                    (_UINT32_(0x1) << L2CC_ICR_ERRRD_Pos)                /* (L2CC_ICR) Error on L2 Data RAM, Read Mask */
#define L2CC_ICR_ERRRD(value)                 (L2CC_ICR_ERRRD_Msk & (_UINT32_(value) << L2CC_ICR_ERRRD_Pos)) /* Assigment of value for ERRRD in the L2CC_ICR register */
#define L2CC_ICR_SLVERR_Pos                   _UINT32_(7)                                          /* (L2CC_ICR) SLVERR from L3 memory Position */
#define L2CC_ICR_SLVERR_Msk                   (_UINT32_(0x1) << L2CC_ICR_SLVERR_Pos)               /* (L2CC_ICR) SLVERR from L3 memory Mask */
#define L2CC_ICR_SLVERR(value)                (L2CC_ICR_SLVERR_Msk & (_UINT32_(value) << L2CC_ICR_SLVERR_Pos)) /* Assigment of value for SLVERR in the L2CC_ICR register */
#define L2CC_ICR_DECERR_Pos                   _UINT32_(8)                                          /* (L2CC_ICR) DECERR from L3 memory Position */
#define L2CC_ICR_DECERR_Msk                   (_UINT32_(0x1) << L2CC_ICR_DECERR_Pos)               /* (L2CC_ICR) DECERR from L3 memory Mask */
#define L2CC_ICR_DECERR(value)                (L2CC_ICR_DECERR_Msk & (_UINT32_(value) << L2CC_ICR_DECERR_Pos)) /* Assigment of value for DECERR in the L2CC_ICR register */
#define L2CC_ICR_Msk                          _UINT32_(0x000001FF)                                 /* (L2CC_ICR) Register Mask  */


/* -------- L2CC_CSR : (L2CC Offset: 0x730) (R/W 32) Cache Synchronization Register -------- */
#define L2CC_CSR_C_Pos                        _UINT32_(0)                                          /* (L2CC_CSR) Cache Synchronization Status Position */
#define L2CC_CSR_C_Msk                        (_UINT32_(0x1) << L2CC_CSR_C_Pos)                    /* (L2CC_CSR) Cache Synchronization Status Mask */
#define L2CC_CSR_C(value)                     (L2CC_CSR_C_Msk & (_UINT32_(value) << L2CC_CSR_C_Pos)) /* Assigment of value for C in the L2CC_CSR register */
#define L2CC_CSR_Msk                          _UINT32_(0x00000001)                                 /* (L2CC_CSR) Register Mask  */


/* -------- L2CC_IPALR : (L2CC Offset: 0x770) (R/W 32) Invalidate Physical Address Line Register -------- */
#define L2CC_IPALR_C_Pos                      _UINT32_(0)                                          /* (L2CC_IPALR) Cache Synchronization Status Position */
#define L2CC_IPALR_C_Msk                      (_UINT32_(0x1) << L2CC_IPALR_C_Pos)                  /* (L2CC_IPALR) Cache Synchronization Status Mask */
#define L2CC_IPALR_C(value)                   (L2CC_IPALR_C_Msk & (_UINT32_(value) << L2CC_IPALR_C_Pos)) /* Assigment of value for C in the L2CC_IPALR register */
#define L2CC_IPALR_IDX_Pos                    _UINT32_(5)                                          /* (L2CC_IPALR) Index Number Position */
#define L2CC_IPALR_IDX_Msk                    (_UINT32_(0x1FF) << L2CC_IPALR_IDX_Pos)              /* (L2CC_IPALR) Index Number Mask */
#define L2CC_IPALR_IDX(value)                 (L2CC_IPALR_IDX_Msk & (_UINT32_(value) << L2CC_IPALR_IDX_Pos)) /* Assigment of value for IDX in the L2CC_IPALR register */
#define L2CC_IPALR_TAG_Pos                    _UINT32_(14)                                         /* (L2CC_IPALR) Tag Number Position */
#define L2CC_IPALR_TAG_Msk                    (_UINT32_(0x3FFFF) << L2CC_IPALR_TAG_Pos)            /* (L2CC_IPALR) Tag Number Mask */
#define L2CC_IPALR_TAG(value)                 (L2CC_IPALR_TAG_Msk & (_UINT32_(value) << L2CC_IPALR_TAG_Pos)) /* Assigment of value for TAG in the L2CC_IPALR register */
#define L2CC_IPALR_Msk                        _UINT32_(0xFFFFFFE1)                                 /* (L2CC_IPALR) Register Mask  */


