Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
/* -------- L2CC_ILKR : (L2CC Offset: 0x904) (R/W 32) Instruction Lockdown Register -------- */
#define L2CC_ILKR_ILK0_Pos                    _UINT32_(0)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 0 Position */
#define L2CC_ILKR_ILK0_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK0_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 0 Mask */
#define L2CC_ILKR_ILK0(value)                 (L2CC_ILKR_ILK0_Msk & (_UINT32_(value) << L2CC_ILKR_ILK0_Pos)) /* Assigment of value for ILK0 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK1_Pos                    _UINT32_(1)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 1 Position */
#define L2CC_ILKR_ILK1_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK1_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 1 Mask */
#define L2CC_ILKR_ILK1(value)                 (L2CC_ILKR_ILK1_Msk & (_UINT32_(value) << L2CC_ILKR_ILK1_Pos)) /* Assigment of value for ILK1 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK2_Pos                    _UINT32_(2)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 2 Position */
#define L2CC_ILKR_ILK2_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK2_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 2 Mask */
#define L2CC_ILKR_ILK2(value)                 (L2CC_ILKR_ILK2_Msk & (_UINT32_(value) << L2CC_ILKR_ILK2_Pos)) /* Assigment of value for ILK2 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK3_Pos                    _UINT32_(3)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 3 Position */
#define L2CC_ILKR_ILK3_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK3_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 3 Mask */
#define L2CC_ILKR_ILK3(value)                 (L2CC_ILKR_ILK3_Msk & (_UINT32_(value) << L2CC_ILKR_ILK3_Pos)) /* Assigment of value for ILK3 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK4_Pos                    _UINT32_(4)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 4 Position */
#define L2CC_ILKR_ILK4_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK4_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 4 Mask */
#define L2CC_ILKR_ILK4(value)                 (L2CC_ILKR_ILK4_Msk & (_UINT32_(value) << L2CC_ILKR_ILK4_Pos)) /* Assigment of value for ILK4 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK5_Pos                    _UINT32_(5)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 5 Position */
#define L2CC_ILKR_ILK5_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK5_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 5 Mask */
#define L2CC_ILKR_ILK5(value)                 (L2CC_ILKR_ILK5_Msk & (_UINT32_(value) << L2CC_ILKR_ILK5_Pos)) /* Assigment of value for ILK5 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK6_Pos                    _UINT32_(6)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 6 Position */
#define L2CC_ILKR_ILK6_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK6_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 6 Mask */
#define L2CC_ILKR_ILK6(value)                 (L2CC_ILKR_ILK6_Msk & (_UINT32_(value) << L2CC_ILKR_ILK6_Pos)) /* Assigment of value for ILK6 in the L2CC_ILKR register */
#define L2CC_ILKR_ILK7_Pos                    _UINT32_(7)                                          /* (L2CC_ILKR) Instruction Lockdown in Way Number 7 Position */
#define L2CC_ILKR_ILK7_Msk                    (_UINT32_(0x1) << L2CC_ILKR_ILK7_Pos)                /* (L2CC_ILKR) Instruction Lockdown in Way Number 7 Mask */
#define L2CC_ILKR_ILK7(value)                 (L2CC_ILKR_ILK7_Msk & (_UINT32_(value) << L2CC_ILKR_ILK7_Pos)) /* Assigment of value for ILK7 in the L2CC_ILKR register */
#define L2CC_ILKR_Msk                         _UINT32_(0x000000FF)                                 /* (L2CC_ILKR) Register Mask  */

#define L2CC_ILKR_ILK_Pos                     _UINT32_(0)                                          /* (L2CC_ILKR Position) Instruction Lockdown in Way Number 7 */
#define L2CC_ILKR_ILK_Msk                     (_UINT32_(0xFF) << L2CC_ILKR_ILK_Pos)                /* (L2CC_ILKR Mask) ILK */
#define L2CC_ILKR_ILK(value)                  (L2CC_ILKR_ILK_Msk & (_UINT32_(value) << L2CC_ILKR_ILK_Pos)) 

/* -------- L2CC_DCR : (L2CC Offset: 0xF40) (R/W 32) Debug Control Register -------- */
#define L2CC_DCR_DCL_Pos                      _UINT32_(0)                                          /* (L2CC_DCR) Disable Cache Linefill Position */
#define L2CC_DCR_DCL_Msk                      (_UINT32_(0x1) << L2CC_DCR_DCL_Pos)                  /* (L2CC_DCR) Disable Cache Linefill Mask */
#define L2CC_DCR_DCL(value)                   (L2CC_DCR_DCL_Msk & (_UINT32_(value) << L2CC_DCR_DCL_Pos)) /* Assigment of value for DCL in the L2CC_DCR register */
#define L2CC_DCR_DWB_Pos                      _UINT32_(1)                                          /* (L2CC_DCR) Disable Write-back, Force Write-through Position */
#define L2CC_DCR_DWB_Msk                      (_UINT32_(0x1) << L2CC_DCR_DWB_Pos)                  /* (L2CC_DCR) Disable Write-back, Force Write-through Mask */
#define L2CC_DCR_DWB(value)                   (L2CC_DCR_DWB_Msk & (_UINT32_(value) << L2CC_DCR_DWB_Pos)) /* Assigment of value for DWB in the L2CC_DCR register */
#define L2CC_DCR_SPNIDEN_Pos                  _UINT32_(2)                                          /* (L2CC_DCR) SPNIDEN Value Position */
#define L2CC_DCR_SPNIDEN_Msk                  (_UINT32_(0x1) << L2CC_DCR_SPNIDEN_Pos)              /* (L2CC_DCR) SPNIDEN Value Mask */
#define L2CC_DCR_SPNIDEN(value)               (L2CC_DCR_SPNIDEN_Msk & (_UINT32_(value) << L2CC_DCR_SPNIDEN_Pos)) /* Assigment of value for SPNIDEN in the L2CC_DCR register */
#define L2CC_DCR_Msk                          _UINT32_(0x00000007)                                 /* (L2CC_DCR) Register Mask  */


