Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
/* -------- L2CC_PCR : (L2CC Offset: 0xF60) (R/W 32) Prefetch Control Register -------- */
#define L2CC_PCR_OFFSET_Pos                   _UINT32_(0)                                          /* (L2CC_PCR) Prefetch Offset Position */
#define L2CC_PCR_OFFSET_Msk                   (_UINT32_(0x1F) << L2CC_PCR_OFFSET_Pos)              /* (L2CC_PCR) Prefetch Offset Mask */
#define L2CC_PCR_OFFSET(value)                (L2CC_PCR_OFFSET_Msk & (_UINT32_(value) << L2CC_PCR_OFFSET_Pos)) /* Assigment of value for OFFSET in the L2CC_PCR register */
#define L2CC_PCR_NSIDEN_Pos                   _UINT32_(21)                                         /* (L2CC_PCR) Not Same ID on Exclusive Sequence Enable Position */
#define L2CC_PCR_NSIDEN_Msk                   (_UINT32_(0x1) << L2CC_PCR_NSIDEN_Pos)               /* (L2CC_PCR) Not Same ID on Exclusive Sequence Enable Mask */
#define L2CC_PCR_NSIDEN(value)                (L2CC_PCR_NSIDEN_Msk & (_UINT32_(value) << L2CC_PCR_NSIDEN_Pos)) /* Assigment of value for NSIDEN in the L2CC_PCR register */
#define L2CC_PCR_IDLEN_Pos                    _UINT32_(23)                                         /* (L2CC_PCR) INCR Double Linefill Enable Position */
#define L2CC_PCR_IDLEN_Msk                    (_UINT32_(0x1) << L2CC_PCR_IDLEN_Pos)                /* (L2CC_PCR) INCR Double Linefill Enable Mask */
#define L2CC_PCR_IDLEN(value)                 (L2CC_PCR_IDLEN_Msk & (_UINT32_(value) << L2CC_PCR_IDLEN_Pos)) /* Assigment of value for IDLEN in the L2CC_PCR register */
#define L2CC_PCR_PDEN_Pos                     _UINT32_(24)                                         /* (L2CC_PCR) Prefetch Drop Enable Position */
#define L2CC_PCR_PDEN_Msk                     (_UINT32_(0x1) << L2CC_PCR_PDEN_Pos)                 /* (L2CC_PCR) Prefetch Drop Enable Mask */
#define L2CC_PCR_PDEN(value)                  (L2CC_PCR_PDEN_Msk & (_UINT32_(value) << L2CC_PCR_PDEN_Pos)) /* Assigment of value for PDEN in the L2CC_PCR register */
#define L2CC_PCR_DLFWRDIS_Pos                 _UINT32_(27)                                         /* (L2CC_PCR) Double Linefill on WRAP Read Disable Position */
#define L2CC_PCR_DLFWRDIS_Msk                 (_UINT32_(0x1) << L2CC_PCR_DLFWRDIS_Pos)             /* (L2CC_PCR) Double Linefill on WRAP Read Disable Mask */
#define L2CC_PCR_DLFWRDIS(value)              (L2CC_PCR_DLFWRDIS_Msk & (_UINT32_(value) << L2CC_PCR_DLFWRDIS_Pos)) /* Assigment of value for DLFWRDIS in the L2CC_PCR register */
#define L2CC_PCR_DATPEN_Pos                   _UINT32_(28)                                         /* (L2CC_PCR) Data Prefetch Enable Position */
#define L2CC_PCR_DATPEN_Msk                   (_UINT32_(0x1) << L2CC_PCR_DATPEN_Pos)               /* (L2CC_PCR) Data Prefetch Enable Mask */
#define L2CC_PCR_DATPEN(value)                (L2CC_PCR_DATPEN_Msk & (_UINT32_(value) << L2CC_PCR_DATPEN_Pos)) /* Assigment of value for DATPEN in the L2CC_PCR register */
#define L2CC_PCR_INSPEN_Pos                   _UINT32_(29)                                         /* (L2CC_PCR) Instruction Prefetch Enable Position */
#define L2CC_PCR_INSPEN_Msk                   (_UINT32_(0x1) << L2CC_PCR_INSPEN_Pos)               /* (L2CC_PCR) Instruction Prefetch Enable Mask */
#define L2CC_PCR_INSPEN(value)                (L2CC_PCR_INSPEN_Msk & (_UINT32_(value) << L2CC_PCR_INSPEN_Pos)) /* Assigment of value for INSPEN in the L2CC_PCR register */
#define L2CC_PCR_DLEN_Pos                     _UINT32_(30)                                         /* (L2CC_PCR) Double Linefill Enable Position */
#define L2CC_PCR_DLEN_Msk                     (_UINT32_(0x1) << L2CC_PCR_DLEN_Pos)                 /* (L2CC_PCR) Double Linefill Enable Mask */
#define L2CC_PCR_DLEN(value)                  (L2CC_PCR_DLEN_Msk & (_UINT32_(value) << L2CC_PCR_DLEN_Pos)) /* Assigment of value for DLEN in the L2CC_PCR register */
#define L2CC_PCR_Msk                          _UINT32_(0x79A0001F)                                 /* (L2CC_PCR) Register Mask  */


/* -------- L2CC_POWCR : (L2CC Offset: 0xF80) (R/W 32) Power Control Register -------- */
#define L2CC_POWCR_STBYEN_Pos                 _UINT32_(0)                                          /* (L2CC_POWCR) Standby Mode Enable Position */
#define L2CC_POWCR_STBYEN_Msk                 (_UINT32_(0x1) << L2CC_POWCR_STBYEN_Pos)             /* (L2CC_POWCR) Standby Mode Enable Mask */
#define L2CC_POWCR_STBYEN(value)              (L2CC_POWCR_STBYEN_Msk & (_UINT32_(value) << L2CC_POWCR_STBYEN_Pos)) /* Assigment of value for STBYEN in the L2CC_POWCR register */
#define L2CC_POWCR_DCKGATEN_Pos               _UINT32_(1)                                          /* (L2CC_POWCR) Dynamic Clock Gating Enable Position */
#define L2CC_POWCR_DCKGATEN_Msk               (_UINT32_(0x1) << L2CC_POWCR_DCKGATEN_Pos)           /* (L2CC_POWCR) Dynamic Clock Gating Enable Mask */
#define L2CC_POWCR_DCKGATEN(value)            (L2CC_POWCR_DCKGATEN_Msk & (_UINT32_(value) << L2CC_POWCR_DCKGATEN_Pos)) /* Assigment of value for DCKGATEN in the L2CC_POWCR register */
#define L2CC_POWCR_Msk                        _UINT32_(0x00000003)                                 /* (L2CC_POWCR) Register Mask  */


/** \brief L2CC register offsets definitions */
#define L2CC_IDR_REG_OFST              _UINT32_(0x00)      /* (L2CC_IDR) Cache ID Register Offset */
#define L2CC_TYPR_REG_OFST             _UINT32_(0x04)      /* (L2CC_TYPR) Cache Type Register Offset */
#define L2CC_CR_REG_OFST               _UINT32_(0x100)     /* (L2CC_CR) Control Register Offset */
#define L2CC_ACR_REG_OFST              _UINT32_(0x104)     /* (L2CC_ACR) Auxiliary Control Register Offset */
#define L2CC_TRCR_REG_OFST             _UINT32_(0x108)     /* (L2CC_TRCR) Tag RAM Control Register Offset */
#define L2CC_DRCR_REG_OFST             _UINT32_(0x10C)     /* (L2CC_DRCR) Data RAM Control Register Offset */
#define L2CC_ECR_REG_OFST              _UINT32_(0x200)     /* (L2CC_ECR) Event Counter Control Register Offset */
#define L2CC_ECFGR1_REG_OFST           _UINT32_(0x204)     /* (L2CC_ECFGR1) Event Counter 1 Configuration Register Offset */
#define L2CC_ECFGR0_REG_OFST           _UINT32_(0x208)     /* (L2CC_ECFGR0) Event Counter 0 Configuration Register Offset */
#define L2CC_EVR1_REG_OFST             _UINT32_(0x20C)     /* (L2CC_EVR1) Event Counter 1 Value Register Offset */
#define L2CC_EVR0_REG_OFST             _UINT32_(0x210)     /* (L2CC_EVR0) Event Counter 0 Value Register Offset */
#define L2CC_IMR_REG_OFST              _UINT32_(0x214)     /* (L2CC_IMR) Interrupt Mask Register Offset */
#define L2CC_MISR_REG_OFST             _UINT32_(0x218)     /* (L2CC_MISR) Masked Interrupt Status Register Offset */
#define L2CC_RISR_REG_OFST             _UINT32_(0x21C)     /* (L2CC_RISR) Raw Interrupt Status Register Offset */
#define L2CC_ICR_REG_OFST              _UINT32_(0x220)     /* (L2CC_ICR) Interrupt Clear Register Offset */
#define L2CC_CSR_REG_OFST              _UINT32_(0x730)     /* (L2CC_CSR) Cache Synchronization Register Offset */
#define L2CC_IPALR_REG_OFST            _UINT32_(0x770)     /* (L2CC_IPALR) Invalidate Physical Address Line Register Offset */
#define L2CC_IWR_REG_OFST              _UINT32_(0x77C)     /* (L2CC_IWR) Invalidate Way Register Offset */
#define L2CC_CPALR_REG_OFST            _UINT32_(0x7B0)     /* (L2CC_CPALR) Clean Physical Address Line Register Offset */
#define L2CC_CIR_REG_OFST              _UINT32_(0x7B8)     /* (L2CC_CIR) Clean Index Register Offset */
#define L2CC_CWR_REG_OFST              _UINT32_(0x7BC)     /* (L2CC_CWR) Clean Way Register Offset */
#define L2CC_CIPALR_REG_OFST           _UINT32_(0x7F0)     /* (L2CC_CIPALR) Clean Invalidate Physical Address Line Register Offset */
#define L2CC_CIIR_REG_OFST             _UINT32_(0x7F8)     /* (L2CC_CIIR) Clean Invalidate Index Register Offset */
#define L2CC_CIWR_REG_OFST             _UINT32_(0x7FC)     /* (L2CC_CIWR) Clean Invalidate Way Register Offset */
#define L2CC_DLKR_REG_OFST             _UINT32_(0x900)     /* (L2CC_DLKR) Data Lockdown Register Offset */
#define L2CC_ILKR_REG_OFST             _UINT32_(0x904)     /* (L2CC_ILKR) Instruction Lockdown Register Offset */
#define L2CC_DCR_REG_OFST              _UINT32_(0xF40)     /* (L2CC_DCR) Debug Control Register Offset */
#define L2CC_PCR_REG_OFST              _UINT32_(0xF60)     /* (L2CC_PCR) Prefetch Control Register Offset */
#define L2CC_POWCR_REG_OFST            _UINT32_(0xF80)     /* (L2CC_POWCR) Power Control Register Offset */

