Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/l2cc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief L2CC register API structure */
typedef struct
{
  __I   uint32_t                       L2CC_IDR;           /**< Offset: 0x00 (R/   32) Cache ID Register */
  __I   uint32_t                       L2CC_TYPR;          /**< Offset: 0x04 (R/   32) Cache Type Register */
  __I   uint8_t                        Reserved1[0xF8];
  __IO  uint32_t                       L2CC_CR;            /**< Offset: 0x100 (R/W  32) Control Register */
  __IO  uint32_t                       L2CC_ACR;           /**< Offset: 0x104 (R/W  32) Auxiliary Control Register */
  __IO  uint32_t                       L2CC_TRCR;          /**< Offset: 0x108 (R/W  32) Tag RAM Control Register */
  __IO  uint32_t                       L2CC_DRCR;          /**< Offset: 0x10C (R/W  32) Data RAM Control Register */
  __I   uint8_t                        Reserved2[0xF0];
  __IO  uint32_t                       L2CC_ECR;           /**< Offset: 0x200 (R/W  32) Event Counter Control Register */
  __IO  uint32_t                       L2CC_ECFGR1;        /**< Offset: 0x204 (R/W  32) Event Counter 1 Configuration Register */
  __IO  uint32_t                       L2CC_ECFGR0;        /**< Offset: 0x208 (R/W  32) Event Counter 0 Configuration Register */
  __IO  uint32_t                       L2CC_EVR1;          /**< Offset: 0x20C (R/W  32) Event Counter 1 Value Register */
  __IO  uint32_t                       L2CC_EVR0;          /**< Offset: 0x210 (R/W  32) Event Counter 0 Value Register */
  __IO  uint32_t                       L2CC_IMR;           /**< Offset: 0x214 (R/W  32) Interrupt Mask Register */
  __I   uint32_t                       L2CC_MISR;          /**< Offset: 0x218 (R/   32) Masked Interrupt Status Register */
  __I   uint32_t                       L2CC_RISR;          /**< Offset: 0x21C (R/   32) Raw Interrupt Status Register */
  __IO  uint32_t                       L2CC_ICR;           /**< Offset: 0x220 (R/W  32) Interrupt Clear Register */
  __I   uint8_t                        Reserved3[0x50C];
  __IO  uint32_t                       L2CC_CSR;           /**< Offset: 0x730 (R/W  32) Cache Synchronization Register */
  __I   uint8_t                        Reserved4[0x3C];
  __IO  uint32_t                       L2CC_IPALR;         /**< Offset: 0x770 (R/W  32) Invalidate Physical Address Line Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       L2CC_IWR;           /**< Offset: 0x77C (R/W  32) Invalidate Way Register */
  __I   uint8_t                        Reserved6[0x30];
  __IO  uint32_t                       L2CC_CPALR;         /**< Offset: 0x7B0 (R/W  32) Clean Physical Address Line Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       L2CC_CIR;           /**< Offset: 0x7B8 (R/W  32) Clean Index Register */
  __IO  uint32_t                       L2CC_CWR;           /**< Offset: 0x7BC (R/W  32) Clean Way Register */
  __I   uint8_t                        Reserved8[0x30];
  __IO  uint32_t                       L2CC_CIPALR;        /**< Offset: 0x7F0 (R/W  32) Clean Invalidate Physical Address Line Register */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       L2CC_CIIR;          /**< Offset: 0x7F8 (R/W  32) Clean Invalidate Index Register */
  __IO  uint32_t                       L2CC_CIWR;          /**< Offset: 0x7FC (R/W  32) Clean Invalidate Way Register */
  __I   uint8_t                        Reserved10[0x100];
  __IO  uint32_t                       L2CC_DLKR;          /**< Offset: 0x900 (R/W  32) Data Lockdown Register */
  __IO  uint32_t                       L2CC_ILKR;          /**< Offset: 0x904 (R/W  32) Instruction Lockdown Register */
  __I   uint8_t                        Reserved11[0x638];
  __IO  uint32_t                       L2CC_DCR;           /**< Offset: 0xF40 (R/W  32) Debug Control Register */
  __I   uint8_t                        Reserved12[0x1C];
  __IO  uint32_t                       L2CC_PCR;           /**< Offset: 0xF60 (R/W  32) Prefetch Control Register */
  __I   uint8_t                        Reserved13[0x1C];
  __IO  uint32_t                       L2CC_POWCR;         /**< Offset: 0xF80 (R/W  32) Power Control Register */
} l2cc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D_L2CC_COMPONENT_H_ */
